driver-tests/filebc/RedeliveryQoS/caInOut/src/jbiasa/http.wsdl

<?xml version="1.0" encoding="windows-1252"?>
<definitions name="http" targetNamespace="http://j2ee.netbeans.org/wsdl/http"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/http" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types/>
    <message name="httpOperationRequest">
        <part name="part1" type="xsd:string"/>
    </message>
    <portType name="httpPortType">
        <operation name="httpOperation">
            <input name="input1" message="tns:httpOperationRequest"/>
        </operation>
    </portType>
    <binding name="httpBinding" type="tns:httpPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="httpOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/http"/>
            </input>
        </operation>
    </binding>
    <service name="httpService">
        <port name="httpPort" binding="tns:httpBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/httpService/httpPort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="http">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="httpPortTypeRole" portType="tns:httpPortType"/>
    </plnk:partnerLinkType>
</definitions>
