driver-tests/filebc/RedeliveryQoS/caInOut/test/DummyTestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:http="http://j2ee.netbeans.org/wsdl/http">
  <soapenv:Body>
    <http:httpOperation>
      <part1>?string?</part1>
    </http:httpOperation>
  </soapenv:Body>
</soapenv:Envelope>